---
kind: type
id: T:Autodesk.Revit.DB.ViewOrientation3D
source: html/027b44d6-a473-4e99-4b43-c938847ea7e3.htm
---
# Autodesk.Revit.DB.ViewOrientation3D

Container for the point and vectors which define View3D's orientation.

## Syntax (C#)
```csharp
public class ViewOrientation3D : IDisposable
```